armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.6.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32L5xx_DFP</name>
  <description>STMicroelectronics STM32L5 Series Device Support</description>
  <url>http://www.keil.com/pack/</url>

  <releases>
    <release version="1.2.0" date="2020-05-18">
      Updated STM32CubeL5 Firmware Package version to version 1.2.0 (using HAL Drivers V1.0.2)
      Board support got moved to dedicated board support pack Keil.STM32l552E-EV_BSP.
      Package Description:
        - Added capability to launch the Option Byte Loading after a Flash Download.
        - Adding STM32CubeMX integration.
      Flash programming algorithms:
        - Reworked existing algorithms.
        - Added OPT algorithm.
      SVD files:
        - Register NSBOOTADDxR, SECBOOTADD0R are read/write.
      CMSIS-Driver:
      - Added USART.
      - Added SPI.
    </release>
    <release version="1.1.0" date="2020-01-07">
      Initial public version of the STM32L5 device family support pack for the:
      STM32L552 and STM32L562 device series.
      Based on STM32Cube L5 Firmware Pack version 1.0.0.
      use with MDK 5.29 recommended.
    </release>
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32L5</keyword>
    <keyword>STM32L5xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32L5 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M33" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dtz="TZ" Dendian="Little-endian" Dclock="110000000"/>
      <description>
     The ARM Cortex-M33 is the most configurable of all Cortex-M processors.
     It is a full featured microcontroller class processor based on the ARMv8-M mainline architecture with ARM TrustZone security.
      </description>
      <book name="Documentation/arm_cortex_m33_dgug_100235_0004_00_en.pdf" title="Cortex-M33 Generic User Guide"/>
      <book name="Documentation/RM0438_STM32L552_STM32L562.pdf" title="STM32L552xx and STM32L562xx Reference Manual"/>

      <algorithm name="CMSIS/Flash/MX25L51245G_STM32L5_OSPI.FLM" start="0x90000000" size="0x04000000" default="0" />
      <algorithm name="CMSIS/Flash/STM32L5x_OPT.FLM"             start="0x1FF00000" size="0x00000030" default="0"/>

      <debugvars configfile="CMSIS/Debug/STM32L552xx_562xx.dbgconf" version="1.0.0">
        __var DbgMCU_CR       = 0x00000006;   // DBGMCU_CR: DBG_STOP, DBG_STANDBY
        __var DbgMCU_APB1L_Fz = 0x00000000;   // DGBMCU_APB1L_FZ: All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB1H_Fz = 0x00000000;   // DGBMCU_APB1H_FZ: All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ : All Peripherals Operate as in Normal Mode
        __var TraceClk_Pin    = 0x00040002;   // PE2
        __var TraceD0_Pin     = 0x00020009;   // PC9
        __var TraceD1_Pin     = 0x0002000A;   // PC10
        __var TraceD2_Pin     = 0x00040005;   // PE5
        __var TraceD3_Pin     = 0x0002000C;   // PC12
        __var DoOptionByteLoading = 0;        // Disabled
      </debugvars>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO enabled?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // Synchronous trace port enabled?

            Sequence("CheckID");
          </block>

          <control if="traceSWO">
            <block>
              Sequence("ConfigureTraceSWOClock");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("ConfigureTraceTPIUClock");
            </block>
          </control>

        </sequence>

        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR

            // Device Specific Debug Setup
            Write32(0xE0044004, DbgMCU_CR | (Read32(0xE0044004) &amp; 0xF0));       // DBGMCU_CR: Configure MCU Debug
            Write32(0xE0044008, DbgMCU_APB1L_Fz);                                   // DBGMCU_APB1_FZ: Configure APB1L Peripheral Freeze Behavior
            Write32(0xE004400C, DbgMCU_APB1H_Fz);                                   // DBGMCU_APB1_FZ: Configure APB1H Peripheral Freeze Behavior
            Write32(0xE0044010, DbgMCU_APB2_Fz);                                    // DBGMCU_APB1_FZ: Configure APB2 Peripheral Freeze Behavior
          </block>
        </sequence>

        <!-- Override for Pre-Defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO (asynchronous) Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // Synchronous trace port enabled?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
            </block>
          </control>

        </sequence>

        <sequence name="TraceStop">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO enabled?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // Synchronous trace port enabled?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("DisableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // AHB-AP

