armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
          <control if="connectionFlash &amp;&amp; DoOptionByteLoading">
            <block>
              // unlock the FLASH_CR
              Write32( FLASH_KEYR, FLASH_KEY1 ) ;
              Write32( FLASH_KEYR, FLASH_KEY2 ) ;
              // unlock the option byte block
              Write32( FLASH_OPTKEYR, FLASH_OPTKEY1 ) ;
              Write32( FLASH_OPTKEYR, FLASH_OPTKEY2 ) ;
              FLASH_CR_Value = Read32( FLASH_CR ) ;
            </block>
            <control if="!( FLASH_CR_Value &amp; ( ( LOCK_BIT ) | ( OPTLOCK_BIT ) ) )">
              <block>
                DoDebugPortStop = 0 ;
                __errorcontrol = 1 ;
                // write OBL_LAUNCH bit (causes a reset)
                Write32( FLASH_CR, FLASH_CR_Value | ( OBL_LAUNCH_BIT ) ) ;
                __errorcontrol = 0 ;
              </block>
            </control>
          </control>
          <control if="DoDebugPortStop">
            <block>
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);
              // Power Down Debug port
              WriteDP(DP_CTRL_STAT, 0x00000000);
            </block>
          </control>
        </sequence>

      </sequences>

      <!-- ************************  Subfamily 'STM32L5x2'  **************************** -->
      <subFamily DsubFamily="STM32L5x2">       

        <book name="Documentation/RM0438_STM32L552_STM32L562.pdf" title="STM32L552xx and STM32L562xx Reference Manual"/>

        <algorithm name="CMSIS/Flash/STM32L5x_512_0C00.FLM"          start="0x0C000000" size="0x00080000" default="1" />
        <algorithm name="CMSIS/Flash/STM32L5x_512_0800.FLM"          start="0x08000000" size="0x00080000" default="1" />

        <!-- *************************  Device 'STM32L552CCTx'  ***************************** -->
        <device Dname="STM32L552CCTx">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00040000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L552CETx'  ***************************** -->
        <device Dname="STM32L552CETx">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L552CCUx'  ***************************** -->
        <device Dname="STM32L552CCUx">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00040000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L552CEUx'  ***************************** -->
        <device Dname="STM32L552CEUx">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L552CETxP'  **************************** -->
        <device Dname="STM32L552CETxP">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L552CEUxP'  **************************** -->
        <device Dname="STM32L552CEUxP">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L552MEYxP'  **************************** -->
        <device Dname="STM32L552MEYxP">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

