armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
          <feature type="CSP" n="81"/>
        </device>

        <!-- *************************  Device 'STM32L552MEYxQ'  **************************** -->
        <device Dname="STM32L552MEYxQ">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="CSP" n="81"/>
        </device>

        <!-- *************************  Device 'STM32L552QCIxQ'  **************************** -->
        <device Dname="STM32L552QCIxQ">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00040000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L552QEIxQ'  **************************** -->
        <device Dname="STM32L552QEIxQ">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L552QEIx'  ***************************** -->
        <device Dname="STM32L552QEIx">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L552QEIxP'  **************************** -->
        <device Dname="STM32L552QEIxP">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L552RCTx'  ***************************** -->
        <device Dname="STM32L552RCTx">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00040000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L552RETx'  ***************************** -->
        <device Dname="STM32L552RETx">
          <debug svd="CMSIS/SVD/STM32L552.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L552xx"/>

          <book name="Documentation/DB3609_STM32L552.pdf"          title="STM32L552xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="64"/>
        </device>

