armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
        <!-- *************************  Device 'STM32L562CETx'  ***************************** -->
        <device Dname="STM32L562CETx">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L562CETxP'  **************************** -->
        <device Dname="STM32L562CETxP">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L562CEUx'  ***************************** -->
        <device Dname="STM32L562CEUx">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L562CEUxP'  **************************** -->
        <device Dname="STM32L562CEUxP">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L562MEYxP'  **************************** -->
        <device Dname="STM32L562MEYxP">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="CSP" n="81"/>
        </device>

        <!-- *************************  Device 'STM32L562MEYxQ'  **************************** -->
        <device Dname="STM32L562MEYxQ">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="CSP" n="81"/>
        </device>

        <!-- *************************  Device 'STM32L562QEIxP'  **************************** -->
        <device Dname="STM32L562QEIxP">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

