armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L562QEIxQ'  **************************** -->
        <device Dname="STM32L562QEIxQ">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L562RETx'  ***************************** -->
        <device Dname="STM32L562RETx">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L562RETxP'  **************************** -->
        <device Dname="STM32L562RETxP">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L562VETx'  ***************************** -->
        <device Dname="STM32L562VETx">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L562VETxQ'  **************************** -->
        <device Dname="STM32L562VETxQ">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L562ZETx'  ***************************** -->
        <device Dname="STM32L562ZETx">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32L562ZETxQ'  **************************** -->
        <device Dname="STM32L562ZETxQ">
          <debug svd="CMSIS/SVD/STM32L562.svd"/>
          <compile header="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h" define="STM32L562xx"/>

          <book name="Documentation/DB3492_STM32L562.pdf"          title="STM32L562xx Data Sheet"/>

          <memory name="Flash-non-secure" access="rx"  id="IROM1" start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash-secure"     access="rx"  id="IROM2" start="0x0C000000" size="0x00080000" default="0" startup="1" />
          <memory name="SRAM-non-secure"  access="rwx" id="IRAM1" start="0x20000000" size="0x00040000" default="1" init="0" />
          <memory name="SRAM-secure"      access="rwx" id="IRAM2" start="0x30000000" size="0x00040000" default="0" init="0" />

          <feature type="QFP" n="144"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Security Conditions -->
    <condition id="isSecure">
      <description>TZ enabled secure app</description>
      <require Dsecure="Secure"/>
    </condition>
    <condition id="isNonSecure">
      <description>TZ enabled non-secure app </description>
      <require Dsecure="Non-secure"/>
    </condition>
    <condition id="noTZ">
      <description>Not TZ enabled app</description>
      <require Dsecure="TZ-disabled"/>
    </condition>


    <!-- Device Conditions -->
    <condition id="STM32L5">
      <description>STMicroelectronics STM32L5 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32L5*"/>
    </condition>

