armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
    <condition id="STM32L552">
      <description>STMicroelectronics STM32L552 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552*"/>
    </condition>
    <condition id="STM32L562">
      <description>STMicroelectronics STM32L562 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562*"/>
    </condition>

    <condition id="STM32L552_S">
      <description>STMicroelectronics STM32L552 Devices Secure Model</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552*"/>
      <require Dsecure="Secure"/>
    </condition>
    <condition id="STM32L562_S">
      <description>STMicroelectronics STM32L562 Devices Secure Model</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562*"/>
      <require Dsecure="Secure"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L5 CMSIS">
      <description>STMicroelectronics STM32L5 Device and CMSIS-CORE</description>
      <require condition="STM32L5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + Compiler Conditions (ARMCC) -->
    <condition id="STM32L552 ARMCC" >
      <description>STMicroelectronics STM32L552 Devices and ARMCC Compiler</description>
      <require condition="STM32L552"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L562 ARMCC" >
      <description>STMicroelectronics STM32L562 Devices and ARMCC Compiler</description>
      <require condition="STM32L562"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + Security + Compiler Conditions (ARMCC) -->
    <condition id="STM32L552xC noTZ ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="noTZ"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L552xC isSecure ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="isSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L552xC isNonSecure ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L552xE noTZ ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="noTZ"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L552xE isSecure ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="isSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L552xE isNonSecure ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L562xE noTZ ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="noTZ"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L562xE isSecure ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="isSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L562xE isNonSecure ARMCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    
    <!-- Device + Compiler Conditions (GCC) -->
    <condition id="STM32L552 GCC" >
      <description>STMicroelectronics STM32L552 Devices and GCC Compiler</description>
      <require condition="STM32L552"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L562 GCC" >
      <description>STMicroelectronics STM32L562 Devices and GCC Compiler</description>
      <require condition="STM32L562"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- Device + Security + Compiler Conditions (GCC) -->
    <condition id="STM32L552xC noTZ GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="noTZ"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L552xC isSecure GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="isSecure"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L552xC isNonSecure GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L552xE noTZ GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="noTZ"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L552xE isSecure GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="isSecure"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L552xE isNonSecure GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L562xE noTZ GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="noTZ"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L562xE isSecure GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="isSecure"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32L562xE isNonSecure GCC" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler GCC"/>
    </condition>

