armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
    <!-- Device + Compiler Conditions (IAR) -->
    <condition id="STM32L552 IAR" >
      <description>STMicroelectronics STM32L552 Devices and IAR Compiler</description>
      <require condition="STM32L552"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L562 IAR" >
      <description>STMicroelectronics STM32L562 Devices and IAR Compiler</description>
      <require condition="STM32L562"/>
      <require condition="Compiler IAR"/>
    </condition>

    <!-- Device + Security + Compiler Conditions (IAR) -->
    <condition id="STM32L552xC noTZ IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="noTZ"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L552xC isSecure IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="isSecure"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L552xC isNonSecure IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?C*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L552xE noTZ IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="noTZ"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L552xE isSecure IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="isSecure"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L552xE isNonSecure IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L552?E*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L562xE noTZ IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="noTZ"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L562xE isSecure IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="isSecure"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32L562xE isNonSecure IAR" >
      <require Dvendor="STMicroelectronics:13" Dname="STM32L562?E*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler IAR"/>
    </condition>

    <!-- HAL Conditions -->
    <condition id="STM32L5 HAL">
      <description>STMicroelectronics STM32L5 Device and HAL</description>
      <require condition="STM32L5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L5 HAL Common">
      <description>STMicroelectronics STM32L5 Device and HAL Common</description>
      <require condition="STM32L5"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <!--require Cclass="Device" Cgroup="STM32Cube Framework"/-->
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>
    <condition id="STM32L5 HAL GPIO Flash">
      <description>STMicroelectronics STM32L5 Device and HAL with GPIO</description>
      <require condition="STM32L5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash"/>
    </condition>
    <condition id="STM32L5 HAL DMA">
      <description>STMicroelectronics STM32L5 Device and HAL with DMA</description>
      <require condition="STM32L5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>

    <!-- LL driver Conditions -->
    <condition id="STM32L5 LL">
      <description>STMicroelectronics STM32L5 Device and LL</description>
      <require condition="STM32L5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L5 LL Common">
      <description>STMicroelectronics STM32L5 Device and LL</description>
      <require condition="STM32L5"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <!--require Cclass="Device" Cgroup="STM32Cube Framework"/-->
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>

    <!-- CMSIS Diver Conditions -->
    <condition id="STM32L5 CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="STM32L5"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPI"/>
    </condition>
    <condition id="STM32L5 CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="STM32L5"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Smartcard"/>
    </condition>
  </conditions>
  
  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <description Cclass="Device" Cgroup="STM32Cube HAL">STM32L5xx Hardware Abstraction Layer (HAL) Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.1.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

