armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.2" condition="STM32L5 CMSIS">
      <description>System Startup for STMicroelectronics STM32L5 Series</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP_STM32L5XX    /* Device Startup for STM32L5 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32L5xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" name="MDK/Device/Source/ARM/STM32L5xx_NS_OPT.s" attr="template" select="Flash Option Bytes (non-secure)" condition="Compiler ARMCC"/>
        <file category="source" name="MDK/Device/Source/ARM/STM32L5xx_S_OPT.s"  attr="template" select="Flash Option Bytes (secure)" condition="Compiler ARMCC"/>

        <!-- common device header file -->
        <file category="header" name="Drivers/CMSIS/Device/ST/STM32L5xx/Include/stm32l5xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source"       condition="STM32L552 ARMCC"               name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/startup_stm32l552xx.s" attr="config" version="1.0.2"/>
        <file category="source"       condition="STM32L562 ARMCC"               name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/startup_stm32l562xx.s" attr="config" version="1.0.2"/>

        <file category="linkerScript" condition="STM32L552xC noTZ ARMCC"        name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l552xc_flash.sct"    attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xC isSecure ARMCC"    name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l552xc_flash_s.sct"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xC isNonSecure ARMCC" name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l552xc_flash_ns.sct" attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE noTZ ARMCC"        name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l552xe_flash.sct"    attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE isSecure ARMCC"    name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l552xe_flash_s.sct"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE isNonSecure ARMCC" name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l552xe_flash_ns.sct" attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE noTZ ARMCC"        name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l562xe_flash.sct"    attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE isSecure ARMCC"    name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l562xe_flash_s.sct"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE isNonSecure ARMCC" name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/arm/linker/stm32l562xe_flash_ns.sct" attr="config" version="1.0.2"/>

        <!-- GCC Toolchain -->
        <file category="source"       condition="STM32L552 GCC"                 name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/startup_stm32l552xx.S"           attr="config" version="1.0.2"/>
        <file category="source"       condition="STM32L562 GCC"                 name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/startup_stm32l562xx.S"           attr="config" version="1.0.2"/>

        <file category="linkerScript" condition="STM32L552xC noTZ GCC"          name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L552xC_FLASH.ld"     attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xC isSecure GCC"      name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L552xC_FLASH_s.ld"   attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xC isNonSecure GCC"   name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L552xC_FLASH_ns.ld"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE noTZ GCC"          name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L552xE_FLASH.ld"     attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE isSecure GCC"      name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L552xE_FLASH_s.ld"   attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE isNonSecure GCC"   name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L552xE_FLASH_ns.ld"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE noTZ GCC"          name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L562xE_FLASH.ld"     attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE isSecure GCC"      name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L562xE_FLASH_s.ld"   attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE isNonSecure GCC"   name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/gcc/linker/STM32L562xE_FLASH_ns.ld"  attr="config" version="1.0.2"/>

        <!-- IAR Toolchain -->
        <file category="source" condition="STM32L552 IAR"                       name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/startup_stm32l552xx.s"           attr="config" version="1.0.2"/>
        <file category="source" condition="STM32L562 IAR"                       name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/startup_stm32l562xx.s"           attr="config" version="1.0.2"/>

        <file category="linkerScript" condition="STM32L552xC noTZ IAR"          name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l552xc_flash.icf"    attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xC isSecure IAR"      name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l552xc_flash_s.icf"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xC isNonSecure IAR"   name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l552xc_flash_ns.icf" attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE noTZ IAR"          name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l552xe_flash.icf"    attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE isSecure IAR"      name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l552xe_flash_s.icf"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L552xE isNonSecure IAR"   name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l552xe_flash_ns.icf" attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE noTZ IAR"          name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l562xe_flash.icf"    attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE isSecure IAR"      name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l562xe_flash_s.icf"  attr="config" version="1.0.2"/>
        <file category="linkerScript" condition="STM32L562xE isNonSecure IAR"   name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/iar/linker/stm32l562xe_flash_ns.icf" attr="config" version="1.0.2"/>

        <!-- system file -->
        <file category="source"                                                 name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/system_stm32l5xx.c"                  attr="config" version="1.0.2" condition="noTZ"/>
        <file category="source"                                                 name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/system_stm32l5xx_s.c"                attr="config" version="1.0.2" condition="isSecure"/>
        <file category="source"                                                 name="Drivers/CMSIS/Device/ST/STM32L5xx/Source/Templates/system_stm32l5xx_ns.c"               attr="config" version="1.0.2" condition="isNonSecure"/>
                                                                                                                                                                              
        <!-- SAU configuration -->                                                                                                                                            
        <file category="header"                                                 name="Drivers/CMSIS/Device/ST/STM32L5xx/Include/partition_stm32l5xx.h"                                      version="1.0.2"/>
        <file category="header" condition="STM32L552_S"                         name="CMSIS/Zone/stm32l552xx/partition_stm32l552xx.h" attr="config" version="1.1.0"/>
        <file category="header" condition="STM32L562_S"                         name="CMSIS/Zone/stm32l562xx/partition_stm32l562xx.h" attr="config" version="1.1.0"/>
        <file category="header" condition="STM32L562_S"                         name="CMSIS/Zone/stm32l562xx/partition_gen.h" attr="config" version="1.1.0"/>
        <file category="header" condition="STM32L552_S"                         name="CMSIS/Zone/stm32l552xx/partition_gen.h" attr="config" version="1.1.0"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" Capiversion="1.1.0" condition="STM32L5">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <!-- this component will be replaced by the component described in gpdsc from generator -->
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.2"/>
      </files>
    </component>

