armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
    <!-- START: STMicroelectronics STM32CubeL5 HAL -->
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"    Cversion="1.0.0" condition="STM32L5 HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="doc"     name="Drivers/STM32L5xx_HAL_Driver/STM32L562xx_User_Manual.chm"/>
        <file category="include" name="Drivers/STM32L5xx_HAL_Driver/Inc/"/>
        <file category="include" name="Drivers/STM32L5xx_HAL_Driver/Inc/Legacy/"/>
        <file category="header"  name="Drivers/STM32L5xx_HAL_Driver/Inc/stm32l5xx_hal.h"/>
        <file category="source"  name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal.c"/>
        <file category="header"  name="Drivers/Config/stm32l5xx_hal_conf.h"               attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"       Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Analog-to-digital converter (ADC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_adc.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_adc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMP"      Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Analog Comparator (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_comp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"    Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_cortex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC"       Cversion="1.0.2" condition="STM32L5 HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_crc.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_crc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP"      Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_cryp.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_cryp_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DAC"       Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Digital-to-analog converter (DAC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_dac.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_dac_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DFSDM"     Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Digital Filter for Sigma-Delta Modulators (DFSDM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DFSDM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_dfsdm.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_dfsdm_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"       Cversion="1.0.2" condition="STM32L5 HAL">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_dma.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_dma_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="EXTI"      Cversion="1.0.2" condition="STM32L5 HAL">
      <description>EXTI HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_EXTI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_exti.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="FDCAN"     Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Controller area network (FDCAN) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FDCAN
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_fdcan.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash"     Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Embedded Flash memory HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_flash.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_flash_ex.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_flash_ramfunc.c"/>
      </files>
    </component>
