armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/未验证的/STM32L5xx（未验证）/Keil.STM32L5xx_DFP.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"      Cversion="1.0.2" condition="STM32L5 HAL">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GTZC"      Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Global TrustZone controller (GTZC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GTZC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_gtzc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HASH"      Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Hash processor (HASH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_hash.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_hash_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"       Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_i2c_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ICACHE"    Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Instruction cache (ICACHE) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ICACHE
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_icache.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"      Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>IrDA HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IRDA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_irda.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IWDG"      Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Independent watchdog (IWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_iwdg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LPTIM"     Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Low-power timer (LPTIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_lptim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MMC"       Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>MMC card HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_mmc.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_mmc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NAND"      Cversion="1.0.2" condition="STM32L5 HAL">
      <description>NAND Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NAND
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_nand.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"       Cversion="1.0.2" condition="STM32L5 HAL">
      <description>NOR Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NOR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_nor.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="OPAMP"     Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Operational amplifier peripheral HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_OPAMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_opamp.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_opamp_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="OSPI"      Cversion="1.0.2" condition="STM32L5 HAL DMA">
      <description>Octo Serial peripheral interface (OSPI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_OSPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_ospi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="OTFDEC"    Cversion="1.0.2" condition="STM32L5 HAL">
      <description>On-the-fly decryption engine (OTFDEC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_OTFDEC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_otfdec.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD"       Cversion="1.0.2" condition="STM32L5 HAL">
      <description>USB Peripheral controller (PCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_pcd.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_pcd_ex.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"       Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Power controller (PWR) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_pwr.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_pwr_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"       Cversion="1.0.2" condition="STM32L5 HAL GPIO Flash">
      <description>Reset and clock control (RCC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_rcc.c"/>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_rcc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RNG"       Cversion="1.0.2" condition="STM32L5 HAL">
      <description>Random number generator (RNG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RNG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_rng.c"/>
      </files>
    </component>
